app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:id])
    @reservation = Reservation.where(:book_id => @book.id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."book_id" = ?  ORDER BY "reservations"."id" ASC LIMIT 1  [["book_id", 7]]

  def update
    @book = Book.find(params[:id])
    @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "books" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "BOOKBOOKBOOK"], ["description", "COOL"], ["updated_at", "2016-04-13 18:23:59.525272"], ["id", 4]]

  def create
    @book = Book.create(book_params)
---
INSERT INTO "books" ("title", "description", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "hjb"], ["description", "kjb"], ["author_id", 1], ["created_at", "2016-04-13 21:16:39.772999"], ["updated_at", "2016-04-13 21:16:39.772999"]]

  def destroy
    Book.find(params[:id]).destroy
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 3]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 3]]