app/controllers/reservations_controller.rb

  def index
    @reservation  = Reservation.all
---
SELECT "reservations".* FROM "reservations"

  def new
    @book = Book.find(params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 6]]

  def show
    @reservation = Reservation.find(params[:id])
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 10]]

  def edit
    @reservation = Reservation.find(params[:id])
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @reservation = Reservation.find(params[:id])
    @reservation.update(reservation_params)
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 9]]
UPDATE "reservations" SET "due_date" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["due_date", "2016-05-04 00:00:00.000000"], ["updated_at", "2016-04-13 19:48:03.736123"], ["id", 9]]

  def create
    @reservation = Reservation.create(reservation_params)
---
INSERT INTO "reservations" ("checkout_date", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["checkout_date", "2016-04-13 00:00:00.000000"], ["due_date", "2016-04-20 00:00:00.000000"], ["created_at", "2016-04-13 18:53:25.632276"], ["updated_at", "2016-04-13 18:53:25.632276"]]

  def destroy
    Reservation.find(params[:id]).destroy
---
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 5]]
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 5]]